Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/supplementary_welfare_schemes/mortgage_interest_supplement.html.txt.tmx
Source language: en
Languages: ga

source: Mortgage Interest Supplement (MIS) provides short-term support to help you pay your mortgage interest repayments
ga: Tugann Fordheontas Ús Morgáiste tacaíocht ghearrthéarmach chun cabhrú leat d’íocaíochtaí ús morgáiste a íoc

source: From 1 January 2014, the Mortgage Interest Supplement scheme is closed to new entrants and no new applications will be accepted from this date
ga: Ó 1 Eanáir 2014, tá deireadh leis an scéim Forlíonadh Ús Morgáiste d'iarratasóirí nua agus ní ghlacfar aon iarratas nua ón dáta seo

source: This measure does not affect current claimants immediately (people who were getting Mortgage Interest Supplement before 1 January 2014)
ga: Ní bhainfidh an beart seo le héilitheoirí reatha láithreach (daoine a fhaigheann Forlíonadh Ús Morgáiste roimh 1 Eanáir 2014

source: The scheme will be wound down for these claimants over a 4-year period
ga: Tiocfaidh an scéim chun críche d’éilitheoirí reatha thar thréimhse 4 bhliain

source: If you are experiencing short-term mortgage difficulties your lender must support and engage with you under the Mortgage Arrears Resolution Process (MARP). The website, keepingyourhome.ie, provides comprehensive information on the services and entitlements available if you are having difficulties making your mortgage repayments
ga: Cuireann an láithreán gréásáin, keepingyourhome.ie, faisnéis chuimsitheach ar fáil ar na seirbhísí agus na teidlíochtaí atá ar fáil má bhíonn deacrachtaí agat agus d’aisíocaíochtaí morgáiste á ndéanamh

source: Information for claimants getting MIS before 1 January 2014
ga: Eolas d'éilitheoirí ag fáil MIS roimh 1 Eanáir 2014

source: Your interest is assessed as your gross monthly interest less mortgage interest relief and any mortgage allowance or mortgage subsidy payable towards the interest part of your mortgage by the local authority
ga: Meastar d'ús mar ús comhlán míosúil arna laghdú d' fhaoiseamh úis morgáiste agus de aon liúntas morgáiste nó fóirdheontas morgáiste a íocann an t-údarás áitiúil le haghaidh na coda úis de do mhorgáiste

source: You will only get assistance with the interest portion of your mortgage repayments
ga: Ní thabharfar cúnamh duit ach amháin le sciar úis na haisíocaíochtaí morgáiste atá agat

source: You will not get help with the portion that pays off the actual loan and house insurance
ga: Ní thabharfar cúnamh duit leis an sciar a íocann an iasacht iarbhír agus árachas tí

source: If you have a consolidated loan, only the interest portion of your loan that relates to the essential purchase, repair or maintenance of your home will be taken into account
ga: Ba chóir duit teagmháil a dhéanamh le d’iasachtóir chun aisíoc na hiasachta iarbhír a phlé

source: The minimum contribution for couples towards Mortgage Interest Supplement increased from €35 to €40 per week (since 1 January 2014). This change applies to new and existing recipients
ga: Má tá iasacht chomhdhlúite agat, ní ghlacfar san áireamh ach an chuid úis de d’iasacht a bhaineann leis an gceannach riachtanach, deisiú nó cothabháil do thí

source: The Mortgage Interest Supplement (MIS) scheme is closed to new entrants from 1 January 2014 and will be wound down for existing recipients over a 4-year period
ga: Ó 1 Eanáir 2014, tá deireadh leis an scéim Forlíonadh Ús Morgáiste d'iarratasóirí nua agus ní ghlacfar aon iarratas nua ón dáta seo

source: To qualify for Mortgage Interest Supplement you must meet the following conditions:
ga: Chun cáiliú d’Fhorlíonadh Ús Morgáiste‚ ní mór duit na coinníollacha a leanas a shásamh:

source: • You must have made an application before 1 January 2014
ga: • Ní mór duit bhfuil iarratas roimh an 1 Eanáir, 2014

source: • You must satisfy the means test
ga: • Ní mór duit an tástáil mhaoine a shásamh

source: • You must have entered into and complied with an alternative repayment arrangement with your mortgage lender for at least 12 months
ga: • Níor mhór gur iontráil tú agus gur chloígh tú le socruithe malairtíocaíochta le d’iasachtaí morgáiste ar feadh 12 mhí ar a laghad

source: • You must have been able to afford the repayments when your loan agreement was first agreed
ga: • Níor mhór go raibh tú in ann íoc as na haisíocaíochtaí nuair a rinneadh do chomhaontú morgáiste a chomhaontú i dtosach

source: • The amount of your mortgage interest payable is not more than what the Department considers reasonable to meet your residential and other needs*
ga: • Ní sháraíonn an méid ús morgáiste atá iníoctha ná é sin a mheasann an Roinn Coimirce is réasúnta chun freastal ar do riachtanais chónaithe agus eile

source: • Only the portion of your loan that relates to the essential purchase, repair or maintenance of your home is taken into account
ga: • Ní chuirtear ach an chuid sin de d’iasacht a bhaineann leis an gceannach‚ deisiú nó cothabháil riachtanach do thí san áireamh

source: • The size of the arrears are not greater than what the Department considers reasonable
ga: • Ní mó méid na riaráistí ná é sin a mheasann an Roinn atá réasúnta

source: • You are habitually resident in this State
ga: • Tá gnáthchónaí ort sa Stát seo

source: *In exceptional circumstances, the Department’s representative may award a supplement where the amount of mortgage interest payable by a person exceeds the amount the Department’s representative considers reasonable to meet his or her residential and other needs
ga: *Má tá méid an úis mhorgáiste is iníoctha ag duine os cionn méid a mheasann an Roinn atá réasúnta chun do riachtanais chóiríochta agus riachtanais eile a chomhlíonadh, i gcúinsí eisceachtúla is féidir le hionadaí na Roinne Coimirce Sóisialaí forlíonadh a bhronnadh

source: This supplement is payable for a maximum of 12 months from the date of the claim
ga: Íoctar an forlíonadh seo ar feadh uasmhéid 12 mhí ó dháta éilimh

source: You can get MIS if your house is for sale
ga: Ní bheifear incháilithe d’Fhordheontas Ús Morgáiste má tá:

source: You won’t qualify for Mortgage Interest Supplement if:
ga: • Tá do theach ar díol

source: • You or your spouse, civil partner or cohabitant works more than 29 hours a week (for exceptions to this rule - see ‘Employment and Mortgage Interest Supplement' below)
ga: • Oibríonn tú féin nó do chéile/pháirtnéir sibhialta/chomhchónaitheoir níos ná 29 n-uaire in aghaidh an seachtaine. (Chun eisceachtaí na rialach seo a fheiceáil, féach ar ‘Fostaíocht agus Fordheontas Ús Morgáiste’ thíos)

source: • You are involved in a trade dispute
ga: • Tá tú bainteach le díospóid trádála

source: • You are attending full-time education (for exceptions to this rule - see 'Education and Mortgage Interest Supplement' below)
ga: • Tá tú ag freastal ar oideachas lánaimseartha (chun eisceachtaí na rialacha seo a fheiceáil - féach ar ‘Oideachas agus Fordheontas Ús Morgáiste’ thíos)

source: • You are unlawfully in the State
ga: • Tá tú sa Stát go neamhdhleathach

source: • You have made an application for asylum under the Refugee Act, 1996 and your application is awaiting final decision by the Minister for Justice and Equality
ga: • Tá iarratas déanta agat ar thearmann faoi Acht na nDídeanaithe, 1996 agus táthar ag feitheamh ar chinneadh deiridh an iarratais ón Aire Dlí agus Cirt agus Comhionannais

source: • You have made an application under the Aliens Act, 1935 to remain in the State and this application has not been determined
ga: • Tá iarratas déanta agat faoi Acht na nEachtrannach, 1935 chun fanacht sa Stát agus níl cinneadh déanta faoin iarratas

source: • You are admitted to an institution (for example, a hospital) for a period of in excess of 13 weeks
ga: • Glactar in institiúid tú (mar shampla, ospidéal) ar feadh tréimhse níos faide ná 13 seachtain

source: Employment and Mortgage Interest Supplement
ga: Fostaíocht agus Fordheontas Ús Morgáiste

source: You will not qualify for Mortgage Interest Supplement if you are in full-time employment
ga: Ní bheifear incháilithe d’Fhordheontas Ús Morgáiste má tá fostaíocht lánaimseartha agat

source: That is, employment for 29 hours per week or more
ga: Sin fostaíocht de 30 uair nó níos mó in aghaidh na seachtaine

source: (In the case of couples, if one of a couple is in full time employment, both are excluded from claiming Mortgage Interest Supplement)
ga: (I gcás lánúineacha, má tá fostaíocht lánaimseartha ag duine den lánúin, bíonn an bheirt eisiata ó Fhordheontas Ús Morgáiste a éileamh)

source: However, there are special retention arrangements that may allow you to keep a proportion of your Mortgage Interest Supplement - for example, if you are participating in a Community Employment Scheme or getting a Back to Work Allowance or Back to Work Enterprise Allowance
ga: Mar sin féin, tá socruithe coinneála speisialta ann a thugann féidearthacht duit maidir le codán den bhFordheontas Ús Morgáiste a choinneáil. Socruithe coinneála speisialta Is féidir leanúint ag fáil Fordheontais Ús Morgáiste nuair atá tú i mbun fostaíochta faoi shocruithe coinneála speisialta, mar shampla, má tá tú rannpháirteach i Scéim Fostaíochta Pobail nó ag fáil Liúntas um Fhilleadh ar Obair

source: Your gross household income must not exceed €317.43 per week
ga: Ní féidir leis an oll-ioncam teaghlaigh bheith níos mó ná €317.43 sa tseachtain

source: Back to Work Allowance, Back to Work Enterprise Allowance, Family Income Supplement (FIS), PRSI, reasonable travel expenses and any childcare allowance payable on certain training courses is not taken into account in the assessment of your gross household income
ga: Is féidir neamhaird a dhéanamh de Liúntas um Fhilleadh ar Obair, Forlíonadh Ioncaim Teaghlaigh (FIT), ÁSPC, costais taistil réasúnta agus liúntas cúraim leanaí ar bith ar chúrsaí oiliúna áirithe sa mheasúnú den teorainn ioncam sheachtainiúil de €317.43

source: Under these special retention arrangements you will continue to get 75% of your Mortgage Interest Supplement rate during your first year in employment, 50% in the second year and 25% in the third and fourth year
ga: Faoi na socruithe coinneála speisialta seo, leanfaidh tú ag fáil 75% den ráta Fordheontais Úis Mhorgáiste sa chéad bhliain fostaíochta, 50% sa dara bliain agus 25% sa tríú agus ceathrú bliain

source: After the fourth year you will no longer be entitled to Mortgage Interest Supplement if you are in employment
ga: Tar éis an ceathrú bliain, ní bheifear incháilithe d’Fhordheontas Ús Morgáiste níos mó má táthar i mbun fostaíochta

source: These retention arrangements also apply to people who have been unemployed for 12 months or more and who return to full-time employment and sign off their social welfare payment
ga: Baineann na socruithe coinneála seo le daoine a bhí dífhostaithe ar feadh 12 mhí nó níos faide agus a fhilleann ar fhostaíocht lánaimseartha agus a chuireann deireadh lena n-íocaíocht leasa shóisialaigh

source: In these cases gross household income must not exceed €317.43 per week
ga: Sna cásanna seo, níor cheart go sáródh ollioncam teaghlaigh €317,43 sa tseachtain

source: Education and Mortgage Interest Supplement
ga: Oideachas agus Fordheontas Ús Morgáiste

source: You won’t qualify for Mortgage Interest Supplement if you are attending full-time education
ga: Ní cháileoidh tú d’Fhordheontas Ús Morgáiste má tá tú ag freastal ar oideachas lánaimseartha

source: However, if you are getting Mortgage Interest Supplement and qualify for the Back to Education Allowance (BTEA), you will keep an entitlement to Mortgage Interest Supplement
ga: Má tá Fordheontas Ús Morgáiste á fháil agat, áfach, agus go gcáilíonn tú don Liúntas um Fhilleadh ar an Oideachas, coinneoidh tú an teidlíocht do Fhordheontas Ús Morgáiste

source: Means test for Mortgage Interest Supplement
ga: Tástáil acmhainne i gcomhair Fordheontas Ús Morgáiste

source: When you apply for Mortgage Interest Supplement your means will be assessed
ga: Nuair a dhéanann tú iarratas ar Fhordheontas Ús Morgáiste, déanfaidh an tOifigeach Leasa Pobail measúnú ar d’acmhainní

source: This will show how much of the mortgage interest you are able to pay
ga: Taispeánfaidh sé seo don Oifigeach Leasa Pobail cén mhéid den ús morgáiste is féidir leat a íoc

source: A means test examines all your sources of income
ga: Déanann tástáil acmhainne iniúchadh ar gach foinse ioncaim atá agat

source: However, some income is not taken into account in the calculation of your means
ga: Ní chuirtear ioncam áirithe, áfach, san áireamh nuair atá d’acmhainn á ríomh

source: You may qualify for Mortgage Interest Supplement if your income is below a certain amount and you meet the other conditions - see 'Rules' above
ga: D’fhéadfadh sé go gcáileodh tú don Fhordheontas Ús Morgáiste má tá d’ioncam faoi mhéid áirithe agus go gcomhlíonann tú na coinníollacha eile - féach ‘Rialacha’ thíos

source: Income taken into account for Mortgage Interest Supplement
ga: Ioncam atá tógtha san áireamh d’Fhordheontas Ús Morgáiste

source: • Net income from employment (this is gross income less PRSI and reasonable travel expenses
ga: • Ioncam glan ó fhostaíocht (sin ioncam comhlán lúide ÁSPC agus costais taistil réasúnta

source: A child dependant aged 17 and under in full-time education will not have their income from employment taken into account for Mortgage Interest Supplement.)
ga: Má bhíonn leanbh cleithiúnach faoi 18 mbliana d'aois agus in oideachas lánaimseartha, ní ghlacfar a hioncam ó fhostaíocht san áireamh.)

source: • Social welfare payments (there are some exceptions - see 'Income not taken into account' below)
ga: • Íocaíochtaí leasa shóisialaigh (tá eisceachtaí áirithe ann, féach ‘Ioncam nach gcuirtear san áireamh’ thíos)

source: • Cash income (for example, maintenance)
ga: • Ioncam in airgead tirim (mar shampla, cothabháil)

source: • All income and the value of all property of which you may have deprived yourself in order to qualify
ga: • Ioncam agus luach na maoine ar fad go mb’fhéidir gur choinnigh tú uait féin le bheith incháilithe

source: • Capital (for example, savings, investments and property but not your own home)
ga: • Caipiteal (mar shampla, maoin seachas do theach féin, coigiltis agus infheistíochtaí)

source: The capital value of property (except your own home), savings and investments are assessed on a weekly basis as follows:
ga: Déanfar luach caipitil maoine (seachas do theach féin), infheistíochtaí agus coigiltis a mheasúnú ar bhonn seachtainiúil mar seo a leanas:

source: │Capital │Weekly means assessed as │
ga: │Caipiteal │Maoin sheachtainiúil measúnaithe mar │

source: │First €5,000 │Nil │
ga: │An chéad €5,000 │Dada │

source: │Next €10,000 │€1 per €1,000 │
ga: │An chéad €10,000 eile │€1 in aghaidh gach €1,000 │

source: │Next €25,000 │€2 per €1,000 │
ga: │An chéad €25,000 eile │€2 in aghaidh gach €1,000 │

source: │Any capital over €40,000 │€4 per €1,000 │
ga: │Caipiteal ar bith os cionn €40,000 │€4 in aghaidh gach €1,000 │

source: A redundancy or lump sum payment will be assessed as capital, unless it has been used to reduce the balance of your mortgage or other outstanding loans
ga: Breathnófar ar íocaíocht iomarcaíochta nó íocaíocht cnapshuime mar chaipiteal, mura úsáideadh í chun iarmhéid do mhorgáiste nó iasachtaí eile a laghdú

source: Income not taken into account when calculating Mortgage Interest Supplement
ga: Ioncam nach gcuirtear san áireamh nuair atá Fordheontas Ús Morgáiste á ríomh

source: When calculating your Mortgage Interest Supplement, the following income is not taken into account:
ga: Nuair atá Fordheontas Ús Morgáiste á ríomh, ní thógfaidh an tOifigeach Leasa Pobail (OLP) ioncam ó fhoinsí a leanas san áireamh:

source: • An amount equal to the Supplementary Welfare Allowance (SWA) rate for your household circumstances
ga: • Ráta Liúntas Leasa Forlíontach (LLF) do chúinsí teaghlaigh atá agat

source: • Foster care payments from the Health Service Executive (HSE)
ga: • Íocaíochtaí um chúram altrama ó Fheidhmeannacht na Seirbhíse Sláinte

source: • Payments for accommodating children under the Child Care Act
ga: • Íocaíochtaí as cóiríocht a thabhairt do leanaí faoin Acht um Chúram Leanaí

source: • Income from Gaeltacht students
ga: • Ioncam ó mhic léinn ag freastal ar an nGaeltacht

source: • Grants or allowances from schemes promoting the welfare of blind people
ga: • Deontais nó liúntais ó scéimeanna a chuireann leas na ndall chun cinn

source: • Money received from charitable organisations, for example, St Vincent de Paul
ga: • Airgead a fhaightear ó eagraíochtaí carthanachta, mar shampla, Cumann Naomh Uinseann de Pól

source: • Compensation awarded by the Compensation Tribunal in respect of Hepatitis C contracted from certain blood products, to those who have disabilities caused by Thalidomide and to those receiving compensation under the Residential Institutions Redress Board
ga: • Cúiteamh a dhámh an Bord um Shásamh maidir le Heipitíteas C fuarthas ó tháirgí fola áirithe, dóibh siúd a bhfuil míchumais orthu mar gheall ar Tailídimíd agus dóibh siúd a bhfuil cúiteamh á fháil acu ón mBord um Shásamh i leith Foras Cónaithe

source: • Maintenance grants paid by VECs or local authorities for educational purposes (now replaced by the Student Grant Scheme) • Domiciliary Care Allowance
ga: • Deontais chothabhála arna íoc ag an gCoiste Gairmoideachais nó ag na hÚdaráis Áitiúla chun críocha oideachasúla

source: • Fuel Allowance and the Living Alone Allowance
ga: • Liúntas Breosla agus an Liúntas do Mhaireachtáil Aonair

source: • Pensioners: If you are aged 65 or over (or where one of a couple is of pensionable age) and have a combined household income greater than the rate of SWA appropriate to your household circumstances, the difference between the maximum rate of State Pension (Contributory) appropriate to your circumstance and the rate of SWA appropriate to your circumstances is not taken into account
ga: • Pinsinéirí: Má tá tú 65 bliain d’aois nó níos sine (nó sa chás go bhfuil aois an phinsin bainte amach ag duine den chúpla) agus má tá ioncaim teaghlaigh chomhcheangailte níos mó ná an ráta SWA iomchuí do do chúinsí teaghlaigh, ní thógfar an difríocht idir an ráta íosta de Phinsean Stáit (Ranníocach) iomchuí le do chúinsí agus an ráta LLF iomchuí le do chúinsí san áireamh

source: • Carers' payments: The half-rate Carer's Allowance is never taken into account
ga: • Íocaíochtaí cúramóirí: Ní thógfar Liúntas Cúramóra leath-ráta san áireamh riamh

source: • If you are getting Carer's Allowance, the amount of Carer's Allowance above the appropriate SWA rate for your situation (either the qualified adult rate for a couple or the personal rate of SWA) is not taken into account
ga: • Má tá tú ag fáil Liúntas Cúramóra, ní thógfar méid an liúntais thar an ráta LLF iomchuí do do chúinsí (an ráta do dhuine fásta cleithiúnach do chúpla nó an ráta LLF pearsanta) san áireamh

source: So if you are one of a couple and getting Carer's Allowance the amount of Carer's Allowance being paid less the SWA qualified adult rate is not taken into account and if you are single or a lone parent the amount disregarded is the rate of Carer's Allowance being paid less the personal rate of SWA
ga: Mar sin, más duine de chúpla thú agus má tá tú ag fáil Liúntas Cúramóra, ní thógtar méid an Liúntais Cúramóra atá á íoc lúide an ráta duine fásta cleithiúnach LLF san áireamh agus más duine singil nó más tuismitheoir aonair thú is é an mhéid ar a ndéantar neamhaird uirthi ná ráta an Liúntais Cúramóra atá á íoc lúide an ráta pearsanta de LLF

source: • Any amount of Carer's Benefit in excess of the basic SWA rate for your situation (either the qualified adult rate or the personal rate of SWA) is not taken into account
ga: • Ní thógtar méid ar bith de Shochar Cúramóra thar an bunráta LLF do do chúinsí (an ráta duine fásta cleithiúnach nó an ráta pearsanta LLF) san áireamh

source: • Rehabilitative earnings disregard: A certain amount of your income from rehabilitative work is not taken into account
ga: • Deontas Cúraim Faoisimh • Íocaíocht Chaomhnóra (Ranníocach) agus Íocaíocht Chaomhnóra (Neamh-Ranníocach)

source: If you are getting Disability Allowance or Blind Pension, €120 from rehabilitative training or employment is not taken into account in the assessment for Mortgage Interest Supplement
ga: Má tá Liúntas Míchumais nó Pinsean na nDall á fháil agat, ní thógtar €120 ó oiliúint nó fostaíocht athshlánúcháin san áireamh sa mheasúnú maidir le Fordheontas Ús Morgáiste

source: Any earnings over €120 from rehabilitative training or employment will affect your Mortgage Interest Supplement
ga: Tógtar gach tuilleamh os cionn €120 ó oiliúint nó fostaíocht athshlánúcháin san áireamh agus beidh tionchar aige ar an bhFordheontas Ús Morgáiste atá agat

source: If you are earning above €120 you can be assessed using whichever disregard is most in your interest - either the Rehabilitative earnings disregard or the Household income disregard (but not both)
ga: Má tá tú ag tuilleamh os cionn €120, is féidir measúnú a dhéanamh ort trí Neamhaird Tuillimh Athshlánúcháin nó Neamhaird Ioncaim Teaghlaigh a úsáid (ní féidir an dá cheann a úsáid), cibé atá chun do leasa

source: • Household income disregard: A certain amount of your household income above the appropriate SWA rate is not taken into account
ga: • Is méid áirithe é an Neamhaird Ioncaim Teaghlaigh de d'ioncam teaghlaigh nach dtugtar san áireamh

source: €75 of any additional household income* is not taken into account
ga: Lena chois sin, ní thugtar €75 de ioncam teaghlaigh bhreise'ar bith san áireamh

source: Also, 25% of additional household income over €75 is not taken into account
ga: Ní thógtar 25% den ioncam teaghlaigh bhreiseatá agat os cionn €75 san áireamh freisin

source: There is no upper limit on the amount that can be disregarded
ga: Níl aon uasteorainn ar an méid gur féidir neamhaird a dhéanamh de

source: *Additional household income is income from part-time employment or part-time self-employment, Family Income Supplement, Community Employment (CE), Back to Work Allowance, Back to Enterprise Allowance or FÁS course
ga: *Ioncam teaghlaigh bhreise is ea ioncam ó fhostaíocht pháirtaimseartha nó féinfhostaíocht pháirtaimseartha, Forlíonadh Ioncaim Teaghlaigh, Fostaíocht Pobail (FP), Liúntas um Fhilleadh ar Obair, Liúntas Fiontraíochta um Fhilleadh ar Obair nó cúrsa FÁS

source: Maintenance is also assessed as additional household income (see below)
ga: Déantar cothabháil a mheasúnú mar ioncam teaghlaigh bhreise freisin (féach thíos)

source: Maintenance and Mortgage Interest Supplement
ga: Cothabháil agus Fordheontas Ús Morgáiste

source: Maintenance is assessed as additional household income (see above) and maintenance payments up to €95.23 per week are assessed in full
ga: Déantar cothabháil a mheasúnú mar 'ioncam teaghlaigh bhreise' (féach thuas) agus déantar íocaíochtaí chothabhála suas go dtí €95.23 in aghaidh na seachtaine a mheasúnú ar an iomlán

source: The household income disregard (see above) applies to maintenance payments above this amount
ga: Baineann an Neamhaird Ioncaim Teaghlaigh le híocaíochtaí chothabhála os cionn an méid seo

source: For example, if your only additional household income is maintenance, all of your maintenance payment up to €95.23 per week is assessed in full
ga: Mar shampla, más cothabháil an t-aon ioncam breise atá agat, déantar d’íocaíocht chothabhála ar fad suas go dtí €95.23 in aghaidh na seachtaine a mheasúnú ar an iomlán

source: The household income disregard of €75 applies to sums above this, so that any maintenance between €95.23 and €170.23 is not taken into account
ga: Baineann an Neamhaird Ioncaim Teaghlaigh €75 le suimeanna os cionn €95.23 agus dá bhrí sin ní chuirtear aon chothabháil idir €95.23 agus €170.23 san áireamh
